from typing import Protocol  # Импортируем инструмент для создания интерфейсов/протоколов

class Reportable(Protocol):  # Наш протокол  для проверки наличия отчетов у объектов 

    def get_report_data(self,) -> str:  # Описываем метод, который обязан быть у классов
        ...  # Многоточие — это синтаксис Python, означающий отсутствие тела метода
        #  С помощью него мы гарантируем, что у разных классов нашей библиотеки есть 
        # общий метод get_report_data для генерации отчетов, и мы можем обрабатывать их в одном общем цикле [1]».